БИТУправление_медицинским_центром_демо/src/Enums/ВидыДокументовДляПечати/ВидыДокументовДляПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументовДляПечати</name>
  <enumValues>
    <name>ПечатнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ДоговорСКлиентом</name>
  </enumValues>
  <enumValues>
    <name>ШаблонПечати</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/ПрохождениеМедосмотра/ПрохождениеМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеМедосмотра</name>
  <registerRecords>InformationRegister.НаправленияПоРезультатамМедосмотра</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательМедКомиссии</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокНаПрохождениеМедосмотра</name>
    <type>
      <types>DocumentRef.СписокНаПрохождениеМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВПроведенииДопОбследования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВОбследованииВЦентреПрофпатологии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВАмбулаторномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСтационарномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСанаторноКурортномЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВДиспансерномНаблюдении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВЛечебноПрофилактическомПитании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВНаправленииНаМедикоСоциальнуюЭкспертизу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтойкаяУтратаТрудоспособности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДиспансернаяГруппа</name>
    <type>
      <types>EnumRef.ГруппыЗдоровья</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМедосмотра</name>
    <type>
      <types>EnumRef.ТипыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещениеОПредварительномДиагнозеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзвещениеОПредварительномДиагнозеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Жалобы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исследования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Осмотр</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяКарта</name>
    <type>
      <types>CatalogRef.МедицинскиеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрохожденияМО</name>
    <type>
      <types>EnumRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьГруппаЗдоровья</name>
    <comment>(используется реквизит ДиспансернаяГруппа)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуВАрхиве</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеРЭМД</name>
    <type>
      <types>CatalogRef.СообщенияРЭМД</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКлиента</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦехУчасток</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Профессия</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРаботы</name>
    <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тестовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <comment>Условия обслуживания по медосмотру в рамках договора с контрагентом</comment>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМО</name>
    <type>
      <types>CatalogRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОПрививках</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфекционныйАнамнез</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКЗаключению</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННРаботодателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияМедосмотра</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначенДополнительно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КритичныеПротивопоказания</name>
    <attributes>
      <name>Противопоказание</name>
      <type>
        <types>CatalogRef.МедицинскиеПротивопоказания</types>
      </type>
    </attributes>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Диагнозы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДетализацияДиагноза</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УточненностьДиагноза</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактерЗаболевания</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>Профессиональное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыявленВпервые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофнепригодностьВременная</name>
      <type>
        <types>EnumRef.ХарактерПрофнепригодности</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеФакторыПротивопоказаний</name>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФакторыИУсловияРаботы</name>
    <attributes>
      <name>Фактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПриема</name>
    <comment>Используется только для справок и прочих медосмотров. Не используется для периодических медосмотров работников</comment>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиИПодписиЭМД</name>
    <attributes>
      <name>УИД_ЭМД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_ЭЦП</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьМинздрава</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭМД</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЭМД</name>
      <type>
        <types>CatalogRef.ШаблоныHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокументаЭМД</name>
      <type>
        <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКФайлуВАрхиве</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеРЭМД</name>
      <type>
        <types>CatalogRef.СообщенияРЭМД</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриказВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
        <types>CatalogRef.ПриказыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_Шаблона</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИдентификаторыПриказов</name>
    <attributes>
      <name>ПриказВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
        <types>CatalogRef.ПриказыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/CommonModules/УниверсальныеМеханизмыКлиент/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Выполнение действий перед началом работы системы
//
Процедура ПередНачаломРаботыСистемы() Экспорт
	
	ТребуетсяПерезапуск = Ложь;
	
	ТребуетсяПерезапуск = ТребуетсяПерезапуск Или БИТСтили_ОформлениеИнтерфейса.ПриЗапускеСистемы();
	ТребуетсяПерезапуск = ТребуетсяПерезапуск Или ОбщегоНазначенияСервер.УстановитьКомпактныйРежимТакси();
	
	Если ТребуетсяПерезапуск Тогда
		ПрекратитьРаботуСистемы(Истина);
	КонецЕсли;
	
	ПроцедурыСпециализацииПоставкиКлиент.ПередНачаломРаботыСистемы();
	
КонецПроцедуры

#Область ИнформацияОПрограмме

Функция ПолучитьИнформациюОПрограмме() Экспорт
	
	ИнформацияОПрограмме = УниверсальныеМеханизмыСервер.ПолучитьИнформациюОПрограммеСервер();
	ИнформацияКлиентское = СистемнаяИнформацияОКлиентскомПриложении();
	
	МассивДанныхИнформации = Новый Массив;
	
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Конфигурация",		ИнформацияОПрограмме.ИмяКонфигурации);
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Версия конфигурации", ИнформацияОПрограмме.ВерсияКонфигурации);
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Версия платформы",	ИнформацияОПрограмме.ВерсияПлатформы);

	
	Если ЗначениеЗаполнено(ИнформацияОПрограмме.РасширенияКонфигурации) Тогда
		ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Расширения конфигурации", Символы.ПС + ИнформацияОПрограмме.РасширенияКонфигурации);
	КонецЕсли;
	
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "", "");
	
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Режим", ПредставлениеРежимаБазы(ИнформацияКлиентское.Режим));
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Клиентское приложение",
		ИнформацияОПрограмме.ТипКлиента + " " + ИнформацияКлиентское.ТипПлатформы + " (" + ИнформацияКлиентское.ТипПлатформыТекст + ")" + " (RAM " + ИнформацияКлиентское.ОЗУ + "Гб)");
	//ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "ОС клиентского приложения",	ИнформацияОПрограмме.ВерсияОС + " (RAM " + ИнформацияКлиентское.ОЗУ + " Гб)");
	
	Если ИнформацияКлиентское.Режим <> "Файловый" Тогда
		ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Сервер ",	ИнформацияОПрограмме.ТипПлатформы + " (RAM " + ИнформацияОПрограмме.ОЗУ + "Гб)");
	КонецЕсли;
	
	Возврат МассивДанныхИнформации; 
	
КонецФункции

Процедура ДобавитьФорматированнуюСтрокуВМассив(МассивСтрок, Заголовок, Значение)
	
	ФС_Заголовок = Новый ФорматированнаяСтрока(Заголовок, Новый Шрифт(,,Истина,,Ложь));
	ФС = Новый ФорматированнаяСтрока(	ФС_Заголовок,
										?(ЗначениеЗаполнено(Заголовок), ": ", ""),
										Значение,
										Символы.ПС);
	МассивСтрок.Добавить(ФС);
	
КонецПроцедуры

Функция СистемнаяИнформацияОКлиентскомПриложении()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Инфо = Новый Структура;
	Инфо.Вставить("ТипПлатформы", СистемнаяИнформация.ТипПлатформы);
	Инфо.Вставить("ТипПлатформыТекст", ?(СтрНайти(Строка(СистемнаяИнформация.ТипПлатформы), "64")>0, "64", "32") + НСтр("ru='-разрядный'"));
	Инфо.Вставить("ВерсияОС", СистемнаяИнформация.ВерсияОС);
	Инфо.Вставить("ОЗУ", Окр(СистемнаяИнформация.ОперативнаяПамять/1024 + 0.2));
	Инфо.Вставить("Режим", ПолучитьРежим());
	
	Возврат Инфо;
	
КонецФункции

Функция ПолучитьРежим()
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы()) Тогда
		Возврат "Файловый";
	ИначеЕсли ОбщегоНазначенияКлиентСервер.КлиентПодключенЧерезВебСервер() Тогда
		Возврат "ВебСерверный";
	Иначе
		Возврат "Серверный";
	КонецЕсли; 
	
КонецФункции

Функция ПредставлениеРежимаБазы(Режим)
	
	Если Режим = "Файловый" Тогда
		Возврат НСтр("ru='Файловый'");
	ИначеЕсли Режим = "ВебСерверный" Тогда
		Возврат НСтр("ru='Веб-серверный'");
	Иначе
		Возврат НСтр("ru='Серверный'");
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область ПечатныеФормы

// Процедура открывает общую форму выбора печатных форм. Выводит на печать документ.
//
// Параметры:
//  Объект			 - Метаданные				 - объект медаданных
//  ФормаВладелец	 - ФормаКлиентскогоПриложения	 - владелец ФормаВыбораПечатныхФорм.
//
Процедура ОткрытьФормуВыбораПечатныхФормОбъекта(Объект, ФормаВладелец) Экспорт
	
	Попытка 
		 //Открыть форму выбора печатных форм
		Если ТипЗнч(Объект) = Тип("Массив") Тогда 
			ДокСсылка = Объект[1];
			НаПринтер = Истина;
		Иначе 
			ДокСсылка = Объект;
			НаПринтер = Ложь;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ТолькоПечать, ДокументСсылка", НаПринтер , ДокСсылка);
		
		ДополнительныеПараметры = Новый Структура;
		
		ДополнительныеПараметры.Вставить("Объект", Объект);
		ДополнительныеПараметры.Вставить("НаПринтер", НаПринтер);
		ДополнительныеПараметры.Вставить("ФормаВладелец", ФормаВладелец);
		ДополнительныеПараметры.Вставить("ДокСсылка", ДокСсылка);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораПечатныхФормОбъекта", УниверсальныеМеханизмыКлиент, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораПечатныхФормУпр", ПараметрыФормы, ФормаВладелец, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

Процедура ПослеЗакрытияФормыВыбораПечатныхФормОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		Объект = ДополнительныеПараметры.Объект; 
		ФормаВладелец = ДополнительныеПараметры.ФормаВладелец;
		НаПринтер = ДополнительныеПараметры.НаПринтер;
		ДокСсылка = ДополнительныеПараметры.ДокСсылка;
		
		Если ТипЗнч(Объект) = Тип("Массив") Тогда
			РедактированиеПакета = Ложь;
		Иначе 
			РедактированиеПакета = Результат.РедактированиеПакета;
		КонецЕсли;
		// Печать макета объекта
		Для Каждого Строка Из Результат.ДеревоМакетовПечати.ВыделенныеСтроки Цикл
			СтрокаКнопки = Результат.ДеревоМакетовПечати.ДанныеСтроки(Строка);
			Расшифровка = СтрокаКнопки.Расшифровка;
			мсПакет = Новый Массив;
			Если РедактированиеПакета И ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати") Тогда 
				мсПакет.Добавить(СтрокаКнопки.СсылкаНаВнешнююОбработку);
			Иначе 
				Если ТипЗнч(Объект) = Тип("Массив") Тогда 
					Если ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати") Тогда 
						СоставПакета = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки.СсылкаНаВнешнююОбработку, ДокСсылка);
					Иначе 
						СоставПакета = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки, ДокСсылка);
					КонецЕсли;	
					СтруктураНаПечать = ПечатьДокументовКлиент.НапечататьПакетДокументов(СоставПакета, ДокСсылка, СтрокаКнопки.СсылкаНаВнешнююОбработку, НаПринтер);
				Иначе 
					ВывестиНапечататьДокумент(Объект, Расшифровка,ДокСсылка,Результат.НаПринтер,ФормаВладелец,СтрокаКнопки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если мсПакет.Количество() > 0 Тогда 
			Парам = Новый Структура("Пакет, Источник",мсПакет, ДокСсылка);
			Форма = ПолучитьФорму("ОбщаяФорма.ФормаПакетнойПечати",Парам ,ФормаВладелец);
			Форма.ОткрытьМодально();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ВывестиНапечататьДокумент(Объект, Расшифровка,ДокСсылка,НаПринтерФорма,ФормаВладелец,СтрокаКнопки)
	
	Перем ИспользованиеДиалогаПечати;
	
	Если ТипЗнч(Расшифровка) = Тип("Строка") И Расшифровка <> "Структура" Тогда
	
		СтруктураНаПечать = ПечатьДокументовСервер.ПечатьСервер(ДокСсылка, Расшифровка, 1, НаПринтерФорма); 
	
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Строка") И Расшифровка = "Структура" Тогда
	
		Если ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ВнешниеОбработки") Тогда
	
			стрРасшифровка = новый Структура;
			стрРасшифровка.Вставить("ВидПечатнойФормы", СтрокаКнопки.ВидПечатнойФормы);
			стрРасшифровка.Вставить("СсылкаНаВнешнююОбработку", СтрокаКнопки.СсылкаНаВнешнююОбработку);
			стрРасшифровка.Вставить("ЗаменяемаяПечатнаяФорма", СтрокаКнопки.ЗаменяемаяПечатнаяФорма);
			стрРасшифровка.Вставить("ОбъектПечати", ДокСсылка);
			
			РезультатПечати = ПечатьДокументовКлиент.НапечататьВнешнююФормуСПроверкойРежимаКлиент(Объект, стрРасшифровка);
			Если ТипЗнч(РезультатПечати) = Тип("ТабличныйДокумент") Тогда
				ТабДокумент = РезультатПечати;
				ЭтоДокумент = Найти(ФормаВладелец.ИмяФормы,"Документ") <> 0;
				СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДокумент, 0, НаПринтерФорма, ?(ЭтоДокумент, 
				ОбщегоНазначенияСервер.СформироватьЗаголовокДокумента(Объект), Строка(Объект)), 
					Объект, Расшифровка,,, СтрокаКнопки.Текст);
			Иначе
				Возврат;
			КонецЕсли;

		ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ШаблоныПечати") Тогда
		
			ШаблонПечати = СтрокаКнопки.СсылкаНаВнешнююОбработку;
			СодержаниеОшибки = "";
			Результат = РаботаСШаблонамиПечатиКлиент.ВыполнитьПечатьДокументаПоШаблонуПечати(Объект, ШаблонПечати, СодержаниеОшибки,,Новый Структура("НаПринтер,КоличествоЭкземпляров",НаПринтерФорма,1));
			Если Не Результат Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СодержаниеОшибки);
			КонецЕсли;
				
		ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати") Тогда
			СоставПакета = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки.СсылкаНаВнешнююОбработку, ДокСсылка);
			НаПринтер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКнопки.СсылкаНаВнешнююОбработку, "НаПринтер");
			СтруктураНаПечать = ПечатьДокументовКлиент.НапечататьПакетДокументов(СоставПакета, ДокСсылка, СтрокаКнопки.СсылкаНаВнешнююОбработку, НаПринтер);
			
			Если НаПринтер Тогда
				ИспользованиеДиалогаПечати = РежимИспользованияДиалогаПечати.Использовать;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать,ДокСсылка,ИспользованиеДиалогаПечати);
		
КонецПроцедуры

// Процедура открывает общую форму выбора печатных форм. Выводит на печать документ.
//
// Параметры:
//  Объект			 - Метаданные				 - объект медаданных
//  ФормаВладелец	 - ФормаКлиентскогоПриложения	 - владелец ФормаВыбораПечатныхФорм.
// 
// Возвращаемое значение:
//   Массив. 
//
Функция ОткрытьФормуВыбораПечатныхФормОбъектаМножественнаяПечать(Объект, ФормаВладелец) Экспорт
	
	мсСостав = Новый Массив;
	
	Попытка
		НаПринтер = Истина;
		ДокСсылка = Объект;
		
		// Открыть форму выбора печатных форм
		Форма = ПолучитьФорму("ОбщаяФорма.ФормаВыбораПечатныхФормУпр", ,ФормаВладелец);
		Форма.ДокументСсылка = ДокСсылка;
		Форма.ТолькоПечать = НаПринтер;
			
		Если ТипЗнч(Форма.ОткрытьМодально()) <> Тип("Структура") Тогда
			Возврат мсСостав;
		КонецЕсли;
		
		Для Каждого Строка Из Форма.Элементы.ДеревоМакетовПечати.ВыделенныеСтроки Цикл
			СтрокаКнопки = Форма.Элементы.ДеревоМакетовПечати.ДанныеСтроки(Строка);
			Если ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати")  Тогда
				мсСостав = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки.СсылкаНаВнешнююОбработку, ПредопределенноеЗначение("Документ.ПрохождениеМедосмотра.ПустаяСсылка"));
			Иначе 
				мсСостав.Добавить(СоставПакетаПоКнопке(СтрокаКнопки));
			КонецЕсли;
		КонецЦикла;

	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
	Возврат мсСостав;
		
КонецФункции

Функция СоставПакетаПоКнопке(СтрокаКнопки) Экспорт //+бит
		
	Если ТипЗнч(СтрокаКнопки.Расшифровка) = Тип("Строка") И СтрокаКнопки.Расшифровка <> "Структура" Тогда		
		ВидОбъекта = ПредопределенноеЗначение("Перечисление.ВидыДокументовДляПечати.ПечатнаяФорма");
	ИначеЕсли ТипЗнч(СтрокаКнопки.Расшифровка) = Тип("Строка") И СтрокаКнопки.Расшифровка = "Структура" Тогда
		ВидОбъекта = ПредопределенноеЗначение("Перечисление.ВидыДокументовДляПечати.ПечатнаяФорма");
	ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ШаблоныПечати") Тогда 	
		ВидОбъекта  = ПредопределенноеЗначение("Перечисление.ВидыДокументовДляПечати.ШаблонПечати")
	КонецЕсли;
	
	СтруктураСтрока = Новый Структура;
	СтруктураСтрока.Вставить("ПредставлениеОбъекта", СтрокаКнопки.Имя);
	СтруктураСтрока.Вставить("ВидОбъекта",ВидОбъекта);
	СтруктураСтрока.Вставить("ВключатьВПакет", Ложь);
	СтруктураСтрока.Вставить("КолЭкз",1);
	СтруктураСтрока.Вставить("СсылкаОбъекта",СтрокаКнопки.СсылкаНаВнешнююОбработку);
	СтруктураСтрока.Вставить("Имя",СтрокаКнопки.Имя);
	СтруктураСтрока.Вставить("СсылкаНаВнешнююОбработку",СтрокаКнопки.СсылкаНаВнешнююОбработку);
	СтруктураСтрока.Вставить("ЗаменяемаяПечатнаяФорма",СтрокаКнопки.ВидПечатнойФормы);
	СтруктураСтрока.Вставить("Расшифровка",СтрокаКнопки.Расшифровка);
	СтруктураСтрока.Вставить("ВидПечатнойФормы", СтрокаКнопки.ВидПечатнойФормы);
	СтруктураСтрока.Вставить("Действие", СтрокаКнопки.Действие);
	СтруктураСтрока.Вставить("Текст",СтрокаКнопки.Текст);
	СтруктураСтрока.Вставить("Печатать",Истина);
	СтруктураСтрока.Вставить("НаПринтер",Истина);
	
	Возврат СтруктураСтрока;
	
КонецФункции

// Процедура - Печать документов множественная печать
//
// Параметры:
//  мсПФ						 - Массив - массив имен печатных форм.
//  ДокСсылка					 - ДокументСсылка	 - печатаемый объект.
//  ИспользованиеДиалогаПечати	 - Булево	 - показывать ли диалог печати.
//
Процедура ПечатьДокументовМножественнаяПечать(мсПФ,ДокСсылка,ИспользованиеДиалогаПечати) Экспорт
	
	СтруктураНаПечать = ПечатьДокументовКлиент.НапечататьПакетДокументов(мсПФ,ДокСсылка,,Истина);
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать,ДокСсылка,ИспользованиеДиалогаПечати);
	
КонецПроцедуры

#КонецОбласти

#Область глОбщиеЗначения // Работа с клиентским кешем глОбщиеЗначения (переменная модуля приложения).

Функция ПолучитьЗначениеКлиентскогоКеша(Ключ) Экспорт
	
	Значение = Неопределено;
	
	Если ТипЗнч(глОбщиеЗначения) = Тип("Структура") Тогда
		глОбщиеЗначения.Свойство(Ключ, Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура УстановитьЗначениеКлиентскогоКеша(Ключ, Значение) Экспорт
	
	Если глОбщиеЗначения = Неопределено Тогда
		глОбщиеЗначения = Новый Структура;
	КонецЕсли;
	
	глОбщиеЗначения.Вставить(Ключ, Значение);
	
КонецПроцедуры

Процедура УдалитьЗначениеКлиентскогоКеша(Ключ) Экспорт
	
	Если ТипЗнч(глОбщиеЗначения) = Тип("Структура")
		И глОбщиеЗначения.Свойство(Ключ)
	Тогда
		глОбщиеЗначения.Удалить(Ключ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
